
# 숫자형
# 1 2 3 4 5


# 문자가 하나만 있으면 문자라고 하고,
'a' 

# 문자가 2개 이상이면 문자열이라고 합니다.
'abc'

"Hello"

# print 함수는 화면에 무엇인가를 출력해주는 함수입니다.

# 그래서 print 함수를 이용하지 않고 위와 같이 값만을 적게 되면, 당연히 화면에 출력되는 것이
# 아무것도 없겠죠?

# 숫자형(Number)

# 정수: 123, -345, 0

# 실수: 123.45, -1234.5, 3.4e10

# 10진수: 10개로 이루어진 수, 0 ~ 9

# 8진수: 0 ~ 7

# 16진수: 0 ~ 9 + a ~ f (a, b, c, d, e, f)

a = 123

print(a)

a = -178

print(a)

# 수학: + (생략해도 괜찮음)가 붙은 수를 가리켜 양수, -가 붙은 수를 가리켜 음수

# 아무것도 없는 것을 나타내는 수가 무엇이 있을까요?

# 0

a = 0

print(a)


# --- 정수에 대해서 알아봤어요,,,

# 실수에서도 양수와 음수에 대한 개념이 존재해요,,,

a = 1.2

print(a)

a = -3.45

print(a)

# --- 실수에 대해서 알아봤어요,,,


a = 3

b = 4

print(a + b)

# print(3 + 4)

# print(7)

print(b - a)

# print(4 - 3)

# print(1)

print(b * a)

# print(4 * 3)

# print(12)

a = 12

b = 3

print(a / b)

# print(12 / 3)

# print(4)




